reddit_exercise/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ariton's Aritons"], ["description", "You know what it is!"], ["moderator_id", 1], ["created_at", "2021-02-15 22:25:25.423878"], ["updated_at", "2021-02-15 22:25:25.423878"]]