reddit_exercise/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Md9P3flQl/vgus/ctKjX9g=="], ["updated_at", "2021-02-15 21:44:54.378524"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = generate_session_token!
        self.save!